app/views/tasks/index.html.erb

SELECT "tasks".* FROM "tasks"
SELECT COUNT(*) FROM "tasks"
---
  of Total
  <%= Task.count %>