app/controllers/tasks_controller.rb

  def index
    @q = Task.ransack(params[:q])
    @tasks =Task.all
---
SELECT "tasks".* FROM "tasks"

  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("task_name", "task_description", "deadline", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["task_name", "study"], ["task_description", "maths"], ["deadline", "2022-12-06 01:36:00"], ["created_at", "2022-12-05 20:07:02.588507"], ["updated_at", "2022-12-05 20:07:02.588507"]]

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE "tasks" SET "deadline" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["deadline", "2022-10-13 17:54:00"], ["updated_at", "2022-10-13 12:24:35.111770"], ["id", 36]]